Configuration/DataProcessors/бит_ум_ДоверенностьИностранца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ум_ДоверенностьИностранца</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доверитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Configuration/DataProcessors/бит_ум_ДоверенностьИностранца/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Доверенность") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Доверенность", НСтр("ru = 'Доверенность'"), 
			ПечатьДоверенности(МассивОбъектов, ОбъектыПечати, ПараметрыПечати), , "Обработка.бит_ум_ДоверенностьИностранца.ПФ_MXL_Доверенность");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьДоверенности(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ум_ДоверенностьИностранца_Доверенность";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.бит_ум_ДоверенностьИностранца.ПФ_MXL_Доверенность");
	
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда
		Доверитель = МассивОбъектов[0];
	Иначе
		Доверитель = МассивОбъектов;
	КонецЕсли;
	ДоверенноеЛицо = ПараметрыПечати.ДоверенноеЛицо;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДЛФ=DD"));
	ПараметрыЗаполнения.Вставить("ГосударственныйОрган", ПараметрыПечати.ГосударственныйОрган);
	
	Массив = Новый Массив;
	Массив.Добавить(Доверитель);
	Массив.Добавить(ДоверенноеЛицо);
	
	КадровыеДанные = "ФИО, Фамилия, Имя, Отчество, ДокументВид, ДокументДатаВыдачи, ДокументСрокДействия, ДокументСерия,
		|ДокументНомер, ДокументКемВыдан, Страна, АдресПоПропискеПредставление";
	
	КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, Массив, КадровыеДанные, ТекущаяДата());
	
	СтрокаДоверитель = КадровыеДанныеФизическихЛиц.Найти(Доверитель, "ФизическоеЛицо");
	Если СтрокаДоверитель <> Неопределено Тогда
		Для Каждого Колонка Из КадровыеДанныеФизическихЛиц.Колонки Цикл
			ПараметрыЗаполнения.Вставить("Доверитель" + Колонка.Имя, СтрокаДоверитель[Колонка.Имя]);
		КонецЦикла;
	КонецЕсли;
	
	СтрокаДоверенноеЛицо = КадровыеДанныеФизическихЛиц.Найти(ДоверенноеЛицо, "ФизическоеЛицо");
	Если СтрокаДоверенноеЛицо <> Неопределено Тогда
		Для Каждого Колонка Из КадровыеДанныеФизическихЛиц.Колонки Цикл
			Если ТипЗнч(СтрокаДоверенноеЛицо[Колонка.Имя]) = Тип("Дата") Тогда
				ПараметрыЗаполнения.Вставить("ДоверенноеЛицо" + Колонка.Имя, Формат(СтрокаДоверенноеЛицо[Колонка.Имя], "ДЛФ=D"));
			Иначе
				ПараметрыЗаполнения.Вставить("ДоверенноеЛицо" + Колонка.Имя, СтрокаДоверенноеЛицо[Колонка.Имя]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Макет.Параметры.Заполнить(ПараметрыЗаполнения);
	
	ТабличныйДокумент.Вывести(Макет);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
